Headlinr_System2/Headlinr_System2/SoapCalls/requestAll.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
               xmlns:tns="http://tempuri.org/">
	<soap:Body>
		<tns:GetAllRss/>
	</soap:Body>
</soap:Envelope>